renesas/rx-driver-package/source/r_sdhi_rx/r_sdhi_rx_vx.xx/r_sdhi_rx/src/targets/rx64m/r_sdhi_dev.c
    /* SDHI_MEM */
    if (int_isr & (SDHI_CH0_INT_CDETI | SDHI_CH0_INT_CACI))
    {
        sdsts1 = SDHI_INREG(p_hndl, SDHI_SDSTS1);
        sdsts2 = SDHI_INREG(p_hndl, SDHI_SDSTS2);
        if (sdsts1 | sdsts2)
        {
            if (p_hndl->int_callback)
            {
                (*p_hndl->int_callback)(sdsts1, sdsts2);
            }
        }
    }

    /* SDHI_SDIO */
    if (int_isr & SDHI_CH0_INT_SDACI)
    {
        sdiosts = SDHI_INREG(p_hndl, SDHI_SDIOSTS);
        if (sdiosts)
        {
            if (p_hndl->int_io_callback)
            {
                (*p_hndl->int_io_callback)(sdiosts);
            }
        }
    }

    return;

} /* End of function R_SDHI_IntHandler0() */

/**********************************************************************************************************************
* Outline      : Hardware Lock
* Function Name: r_sdhi_dev_hardware_lock
* Description  : Hardware Lock.
* Arguments    : uint32_t           channel     ; Channel No.
* Return Value : true                           ; Lock was acquired.
*              : false                          ; Lock was not acquired.
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
bool r_sdhi_dev_hardware_lock(uint32_t channel)
{
    return R_BSP_HardwareLock((mcu_lock_t)(BSP_LOCK_SDHI + channel));
} /* End of function r_sdhi_dev_hardware_lock() */

/**********************************************************************************************************************
* Outline      : Hardware Unlock
* Function Name: r_sdhi_dev_hardware_unlock
* Description  : Hardware Unlock.
* Arguments    : uint32_t           channel     ; Channel No.
* Return Value : true                           ; Lock was released.
*              : false                          ; Lock was not released.
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
bool r_sdhi_dev_hardware_unlock(uint32_t channel)
{
    return R_BSP_HardwareUnlock((mcu_lock_t)(BSP_LOCK_SDHI + channel));
} /* End of function r_sdhi_dev_hardware_unlock() */

#endif /* defined(BSP_MCU_RX64M) */

/* End of File */
